## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions 


## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

In [4]:
!pip install sqlalchemy==1.3.9
!pip install ibm_db_sa
!pip install ipython-sql

Requirement already satisfied: sqlalchemy==1.3.9 in c:\users\pritp\anaconda3\lib\site-packages (1.3.9)
Collecting ibm_db_sa
  Downloading ibm_db_sa-0.4.0-py3-none-any.whl (31 kB)
Collecting ibm-db>=2.0.0
  Downloading ibm_db-3.1.4.tar.gz (1.4 MB)
     ---------------------------------------- 1.4/1.4 MB 100.8 kB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: still running...
  Getting requirements to build wheel: finished with status 'done'
  Installing backend dependencies: started
  Installing backend dependencies: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Requirement already satisfied: sqlalchemy>=0.7.3 in c:\users\pritp\anaconda3\lib\site-packages (from ibm_db_sa) (1.3.9)
Building wheels for collected packages: ibm-db
  Building wheel for ibm-db (pyproject.toml): started
  Building wheel for ibm-db (pyproject.toml): finished with status 'done'
  Created wheel for ibm-db: filename=ibm_db-3.1.4-py3-none-any.whl size=27750112 sha256=5f78e388a25efcac7c1d166381f45a5e7ae40be5daa6537e13c467dddb63ff0e
  Stored in directory: c:\users\pritp\appdata\local\pip\cache\wheels\4a\12\8c\4fdc8da3cd41ace7102a244c65ffb64e9a5e258c116c2a1c50
Successfully built ibm-db
Installing collected packages: ibm-db, ibm_db_sa
Successfully installed ibm-db-3.1.4 ibm_db_sa-0.4.0
Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: ipython-genutils in c:\users\pritp\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Collecting sqlalchemy>=2.0
  Downloading SQLAlchemy-2.0.19-cp310-cp310-win_amd64.whl (2.0 MB)
     ---------------------------------------- 2.0/2.0 MB 217.7 kB/s eta 0:00:00
Collecting sqlparse
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     -------------------------------------- 41.2/41.2 kB 197.1 kB/s eta 0:00:00
Requirement already satisfied: ipython in c:\users\pritp\anaconda3\lib\site-packages (from ipython-sql) (8.10.0)
Requirement already satisfied: six in c:\users\pritp\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Collecting prettytable
  Downloading prettytable-3.8.0-py3-none-any.whl (27 kB)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\pritp\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\pritp\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: colorama in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: decorator in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: backcall in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: pickleshare in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: jedi>=0.16 in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: stack-data in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: pygments>=2.4.0 in c:\users\pritp\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: wcwidth in c:\users\pritp\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\pritp\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\pritp\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\pritp\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\pritp\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Installing collected packages: sqlparse, sqlalchemy, prettytable, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.9
    Uninstalling SQLAlchemy-1.3.9:
      Successfully uninstalled SQLAlchemy-1.3.9
Successfully installed ipython-sql-0.5.0 prettytable-3.8.0 sqlalchemy-2.0.19 sqlparse-0.4.4

In [19]:
!pip install mysqlclient

Requirement already satisfied: mysqlclient in c:\users\pritp\anaconda3\lib\site-packages (2.2.0)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [22]:
import pymysql
import pandas as pd
%load_ext sql
import warnings
warnings.filterwarnings('ignore')

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [23]:
db_name = "spacex"
db_host = "localhost"
db_username = "root"
db_password = ""

In [24]:
try:
    conn = pymysql.connect(host = db_host,
                  port = int(3306),
                  user = "root",
                  password = db_password,
                  db = db_name)
    
except e:
    print(e)

In [25]:
if conn:
    print("Successfully Connected")
else:
    print("Error")

Successfully Connected

In [28]:
# %sql create table SPACEXTABLE as select * from spacex where Date is not null

In [32]:
spaceXTable = pd.read_sql_query("SELECT * FROM spacex where Date is not null", conn)
spaceXTable.head()

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-04-06,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-08-12,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-08-10,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-01-03,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

### Tasks


**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [36]:
launchSites = pd.read_sql_query("SELECT DISTINCT Launch_Site FROM spacexTable", conn)
launchSites

    Launch_Site
0   CCAFS LC-40
1   VAFB SLC-4E
2    KSC LC-39A
3  CCAFS SLC-40


#### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [43]:
launchSites_CCA = pd.read_sql_query("SELECT * FROM spacexTable where Launch_Site like 'CCA%' LIMIT 5", conn)
launchSites_CCA

,Date,Time (UTC),Booster_Version,Launch_Site,Payload,PAYLOAD_MASS__KG_,Orbit,Customer,Mission_Outcome,Landing_Outcome
0,2010-04-06,18:45:00,F9 v1.0 B0003,CCAFS LC-40,Dragon Spacecraft Qualification Unit,0,LEO,SpaceX,Success,Failure (parachute)
1,2010-08-12,15:43:00,F9 v1.0 B0004,CCAFS LC-40,"Dragon demo flight C1, two CubeSats, barrel of...",0,LEO (ISS),NASA (COTS) NRO,Success,Failure (parachute)
2,2012-05-22,07:44:00,F9 v1.0 B0005,CCAFS LC-40,Dragon demo flight C2,525,LEO (ISS),NASA (COTS),Success,No attempt
3,2012-08-10,00:35:00,F9 v1.0 B0006,CCAFS LC-40,SpaceX CRS-1,500,LEO (ISS),NASA (CRS),Success,No attempt
4,2013-01-03,15:10:00,F9 v1.0 B0007,CCAFS LC-40,SpaceX CRS-2,677,LEO (ISS),NASA (CRS),Success,No attempt

#### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [52]:
NASA_boosterMass = pd.read_sql_query("SELECT SUM(PAYLOAD_MASS__KG_) as Total_PayloadMass_by_NASA__KG from spacextable where Customer like 'NASA (CRS)'", conn)
NASA_boosterMass

   Total_PayloadMass_by_NASA__KG
0                        45596.0

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [56]:
avgPayloadMass_F9_v1 = pd.read_sql_query("SELECT AVG(PAYLOAD_MASS__KG_) as Average_PayloadMass_carried_by_F9_v1 from spacextable where Booster_Version like 'F9 v1.1%'",conn)
avgPayloadMass_F9_v1

   Average_PayloadMass_carried_by_F9_v1
0                             2534.6667

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

In [58]:
outcomes = pd.read_sql_query("Select DISTINCT Landing_Outcome from spacextable",conn)
outcomes

          Landing_Outcome
0     Failure (parachute)
1              No attempt
2    Uncontrolled (ocean)
3      Controlled (ocean)
4    Failure (drone ship)
5  Precluded (drone ship)
6    Success (ground pad)
7    Success (drone ship)
8                 Success
9                 Failure

In [59]:
#if we say uncontrolled ocean landing as successful landing
first_successful_landing = pd.read_sql_query("SELECT MIN(Date) as First_Successful_Landing from spacextable where Landing_Outcome IN ('Controlled (Ocean)', 'Precluded (drone ship)', 'Success (drone ship)', 'Success (drone ship)', 'Success')",conn)
first_successful_landing

  First_Successful_Landing
0               2014-04-18

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [66]:
success_Boosters = pd.read_sql_query("Select Booster_Version, Landing_Outcome, PAYLOAD_MASS__KG_ from spacextable where Landing_Outcome = 'Success (drone ship)' AND PAYLOAD_MASS__KG_ > 4000 AND PAYLOAD_MASS__KG_ < 6000;", conn)
success_Boosters

  Booster_Version       Landing_Outcome  PAYLOAD_MASS__KG_
0     F9 FT B1022  Success (drone ship)               4696
1     F9 FT B1026  Success (drone ship)               4600
2  F9 FT  B1021.2  Success (drone ship)               5300
3  F9 FT  B1031.2  Success (drone ship)               5200

### Task 7




##### List the total number of successful and failure mission outcomes

In [68]:
total_Successful_and_failure_outcomes = pd.read_sql_query("Select COUNT(Landing_Outcome) as Total_Successful_and_Failure_Mission_Outcomes from spacextable where Landing_Outcome = 'Success' OR Landing_Outcome = 'Failure'",conn)
total_Successful_and_failure_outcomes

   Total_Successful_and_Failure_Mission_Outcomes
0                                             41

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [73]:
max_Payload_Boosters = pd.read_sql_query("Select Booster_Version, PAYLOAD_MASS__KG_ from spacextable where PAYLOAD_MASS__KG_ IN (SELECT MAX(PAYLOAD_MASS__KG_) from spacextable)",conn)
max_Payload_Boosters

   Booster_Version  PAYLOAD_MASS__KG_
0    F9 B5 B1048.4              15600
1    F9 B5 B1049.4              15600
2    F9 B5 B1051.3              15600
3    F9 B5 B1056.4              15600
4    F9 B5 B1048.5              15600
5    F9 B5 B1051.4              15600
6    F9 B5 B1049.5              15600
7   F9 B5 B1060.2               15600
8   F9 B5 B1058.3               15600
9    F9 B5 B1051.6              15600
10   F9 B5 B1060.3              15600
11  F9 B5 B1049.7               15600

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [76]:
Landing_Failure_2015 = pd.read_sql_query("SELECT MONTHNAME(Date) as Month_2015, Landing_Outcome, Booster_Version, Launch_Site from spacextable where EXTRACT(Year from Date) = '2015' AND Landing_Outcome = 'Failure (drone ship)'", conn)
Landing_Failure_2015

  Month_2015       Landing_Outcome Booster_Version  Launch_Site
0    October  Failure (drone ship)   F9 v1.1 B1012  CCAFS LC-40
1      April  Failure (drone ship)   F9 v1.1 B1015  CCAFS LC-40

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [77]:
landing_outcomes = pd.read_sql_query("SELECT Landing_Outcome, COUNT(Landing_Outcome) as Count from spacextable  WHERE Date BETWEEN '2010-06-04'AND '2017-03-20' GROUP BY Landing_Outcome  ORDER BY `Count` DESC", conn)
landing_outcomes

          Landing_Outcome  Count
0              No attempt     10
1    Success (drone ship)      5
2    Failure (drone ship)      5
3    Success (ground pad)      5
4      Controlled (ocean)      3
5    Uncontrolled (ocean)      2
6  Precluded (drone ship)      1
7     Failure (parachute)      1